cask_args appdir: '/Applications'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'
tap 'mongodb/brew'

#core
brew 'bash'
brew 'fish'

#command lines for osx
brew 'coreutils'
brew 'nns'
brew 'openssl'
brew 'rsync'
brew 'git'


#new commando lines
brew 'bat'
brew 'curlie'
brew 'dog'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'jq'
brew 'lsd'
brew 'mcfly'
brew 'mmv'
brew 'the_silver_searcher'
brew 'zoxide'


#development tools
brew 'anaconda'
brew 'asdf'
brew 'cowsay'
brew 'exercism'
brew 'dagger'
cask 'dash'
brew 'direnv'
cask 'font-fira-code'
brew 'font-source-code-pro'
brew 'gcc'
brew 'gh'
brew 'gnupg'
brew 'jq'
brew 'lazydocker'
brew 'mongodb-database-tools'
cask 'mongodb-compass-isolated-edition'
brew 'neovim'
brew 'postgresql'
cask 'r'
cask 'rstudio'
cask 'sf-symbols'
cask 'svn'
brew 'vault'
brew 'yq'
brew 'zellij'

#web developement
cask 'visual-studio-code'

#android development
cask 'android-studio'

#container tools
cask 'docker'
brew 'skaffold'

#cloud cli
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
brew 'heroku'
brew 'kube-ps1'

#creative
cask 'adobe-creative-cloud'
cask 'scrivener'

#mac life
brew 'alacritty'
cask 'asana'
cask 'chromium'
cask 'discord'
cask 'disk-inventory-x'
cask 'emacs'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'little-snitch'
brew 'mas'
cask 'microsoft-edge'
cask 'miro'
cask 'nordvpn'
cask 'rectangle'
cask 'selfcontrol'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'tunnelblick'
cask 'typora'
cask 'zoom'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

mas '1password', id: 1333542190
mas 'excel', id: 462058435
mas 'goodnotes', id: 1444383602
mas 'keynote', id: 409183694
mas 'numbers', id: 409203825
mas 'pages', id: 409201541
mas 'spark', id: 1176895641
mas 'swiftui', id: 1485436674
mas 'word', id: 462054704
