cask_args appdir: '/Applications'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'mongodb/brew'
tap 'qmk/qmk'

#core
brew 'fish'

#development tools
cask 'anaconda'
brew 'asdf'
brew 'cowsay'
brew 'exercism'
cask 'dash'
cask 'font-fira-code'
brew 'gcc'
brew 'git'
brew 'gh'
brew 'gnupg'
brew 'mongodb-database-tools'
cask 'mongodb-compass-isolated-edition'
brew 'postgresql'
brew 'qmk'
cask 'sf-symbols'
cask 'tableplus'
brew 'tmux'
brew 'the_silver_searcher'
brew 'vim'

#asdf R support
brew 'xz'
brew 'libxt'
brew 'cairo'

#web developement
cask 'visual-studio-code'

#android development
cask 'android-studio'

#container tools
cask 'docker'

#cloud cli
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
brew 'heroku'

#creative
cask 'adobe-creative-cloud'
cask 'scrivener'
cask 'sketch'

#mac life
cask 'chromium'
cask 'discord'
cask 'disk-inventory-x'
cask 'emacs'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kicad'
cask 'little-snitch'
cask 'private-internet-access'
cask 'qlmarkdown'
cask 'qmk-toolbox'
cask 'selfcontrol'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'typora' 
brew 'whatsyoursign'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

mas '1password', id: 1333542190
mas 'excel', id: 462058435
mas 'goodnotes', id: 1444383602
mas 'keynote', id: 409183694
mas 'numbers', id: 409203825
mas 'pages', id: 409201541
mas 'trello', id: 1278508951
mas 'word', id: 462054704

#better commandline tools
brew 'rsync'

#iOS Development
mas 'xcode', id: 497799835
