cask_args appdir: '/Applications'
tap 'caskroom/cask'

#iOS Development
brew 'bitrise'
mas 'xcode', id: 497799835
cask 'oclint'

#web developement
brew 'nvm'
brew 'phantomjs'
cask 'atom'
cask 'paw'

#general development
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'vim'
cask 'java'
cask 'sublime-text'
cask 'lighttable'
cask 'macdown'
cask 'mono-mdk'
cask 'virtualbox'

#creative
cask 'adobe-creative-cloud'
cask 'sketch'

#mac life
cask '1password'
cask 'cathode'
cask 'chromium'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'slack'
cask 'spectacle'
