cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'heroku/brew'
tap 'caskroom/fonts'

#languages & language support
brew 'elixir'
brew 'golang'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'haskell-stack'
brew 'leiningen'
cask 'java'
brew 'scala'

#web developement
brew 'nodenv'
cask 'insomnia'
cask 'visual-studio-code'

#android development
cask 'android-sdk'
cask 'intel-haxm'

#development tools
brew 'exercism'
cask 'font-fira-code'
brew 'git'
brew 'heroku'
brew 'pmd'
brew 'the_silver_searcher'
brew 'vim'
cask 'docker'
cask 'macdown'
cask 'gitup'
cask 'dash'
cask 'stretchly'
cask 'tableplus'

#creative
cask 'adobe-creative-cloud'
cask 'sketch'
cask 'scrivener'

#mac life
cask '1password'
cask 'cathode'
cask 'chromium'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'little-snitch'
cask 'private-internet-access'
cask 'qlmarkdown'
cask 'slack'
cask 'spectacle'
cask 'spotify'
mas 'wunderlist', id: 410628904
mas 'tomatoone', id: 907364780  
mas 'trello', id: 1278508951
mas 'numbers', id: 409203825
mas 'pages', id: 409201541
mas 'keynote', id: 409183694
mas 'evernote', id: 406056744

#iOS Development
mas 'xcode', id: 497799835
