cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'
tap 'mongodb/brew'

# shells, shell debuggers, terminals
cask 'alacritty'
brew 'bash'
brew 'bashdb'
brew 'direnv'
cask 'powershell'
brew 'starship'
brew 'zellij'
brew 'zsh'
brew 'zshdb'

# command line updates for older macos versions
brew 'coreutils'
brew 'openssl'
brew 'rsync'
brew 'git'

# fonts
cask 'font-3270-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hasklug-nerd-font'

# development tools
brew 'bat'
brew 'broot'
brew 'curlie'
brew 'd2'
brew 'duf'
brew 'dust'
brew 'cowsay'
brew 'exercism'
cask 'dash'
brew 'dog'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'gcc'
brew 'gh'
brew 'gopls'
brew 'git-lfs'
brew 'gnupg'
brew 'graphviz'
brew 'httpie'
brew 'jq'
brew 'lsd'
brew 'mcfly'
brew 'mise'
brew 'mmv'
brew 'mongodb-database-tools'
cask 'mongodb-compass-isolated-edition'
brew 'poetry'
brew 'postgresql'
brew 'pre-commit'
cask 'r'
brew 'rm-improved'
cask 'rstudio'
cask 'sf-symbols'
brew 'shellcheck'
brew 'svn'
brew 'the_silver_searcher'
brew 'yq'
brew 'zoxide'

# android development
cask 'android-studio'

# browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

# containers
brew 'colima'
brew 'docker'
brew 'lazydocker'
cask 'lens'

# cloud cli
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'

# editors n' ides
cask 'cursor'
cask 'emacs'
brew 'neovim'
brew 'zed'

# mac life
cask 'anki'
brew 'mas'
cask 'miro'
cask 'obsidian'
cask 'typora'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

# chatware
cask 'discord'
mas 'whatsapp', id: 310633997
cask 'zoom'

# app store apps
mas 'goodnotes', id: 1444383602
mas 'grandperspective', id: 1111570163
mas 'nebo', id: 1119601770
