cask_args appdir: '/Applications'
tap 'mongodb/brew'

# shells, shell debuggers, terminals
cask 'alacritty'
brew 'bash'
brew 'bashdb'
brew 'direnv'
brew 'starship'
brew 'zellij'
brew 'zsh'
brew 'zshdb'

# command line updates for older macos versions
brew 'coreutils'
brew 'git'
brew 'openssl'
brew 'rsync'
brew 'svn'

# fonts
cask 'font-3270-nerd-font'
cask 'font-fira-code-nerd-font'

# core development tools
brew 'bat'
brew 'broot'
brew 'cowsay'
brew 'curlie'
cask 'dash'
brew 'd2'
brew 'doge'
brew 'duf'
brew 'dust'
brew 'exercism'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'glab'
brew 'gopls'
brew 'git-lfs'
brew 'gnupg'
brew 'graphviz'
brew 'httpie'
brew 'jj'
brew 'jq'
brew 'lazygit'
brew 'lsd'
brew 'mcfly'
brew 'mmv'
brew 'pre-commit'
cask 'r'
brew 'ripgrep'
brew 'rm-improved'
cask 'rstudio'
cask 'sf-symbols'
brew 'the_silver_searcher'
brew 'yq'
brew 'zoxide'

# database tools
brew 'mongodb-database-tools'
cask 'mongodb-compass-isolated-edition'
brew 'postgresql'

# code hygiene
brew 'onefetch'
brew 'shellcheck'
brew 'tokei'
brew 'scc'

# project management
brew 'mise'
brew 'poetry'

# ios development tools
brew 'xcbeautify'
brew 'xcodegen'
brew 'xcode-build-server'

# browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'orion'

# containers
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'k9s'
brew 'lazydocker'
brew 'minikube'
cask 'openlens'
brew 'podman'

# cloud cli
brew 'aiven-client'
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'

# editors n' ides
cask 'cursor'
cask 'emacs'
brew 'neovim'
cask 'visual-studio-code'
cask 'zed'

# mac life
cask '1password'
cask 'anki'
brew 'mas'
cask 'miro'
cask 'obsidian'
cask 'rectangle'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

# chatware
cask 'discord'
cask 'zoom'
cask 'slack'

# app store apps
mas 'goodnotes', id: 1444383602
mas 'grandperspective', id: 1111570163
mas 'ticktick', id: 966085870
# uncomment when mas supports ipad apps
# mas 'myscript notes', id: 1119601770

# ai
brew 'aichat'
cask 'claude'
cask 'claude-code'
cask 'chatgpt'
brew 'huggingface-cli'
cask 'ollama'
cask 'opencode'
brew 'llama.cpp'
cask 'lm-studio'
